{
   "id":"State_Capturer",
   "name":"State Capturer",
   "description":{

      "fr_FR":"Ce plugin permet de capturer différents états, de différents équipements et d'appeler ces états par la suite. Pour cela, il suffit de paramétrer dans un équipement State Capturer les équipements que vous souhaitez photographier, de les positionner dans l'état souhaité, et de lancer la capture. Cette capture pourra alors être rechargée. Vous pouvez paramétrer plusieurs captures dans un seul équipement. Chaque capture conserve les valeurs de toutes les commandes info des équipements capturés, et recherche les commandes associées. Ces commandes seront alors automatiquement appelées pour mettre à jour l'équipement. Vous pouvez éditer chaque capture pour définir quelles sont les commandes à mettre à jour, modifier l état conservé, ainsi que les commandes qui contrôlent la modification des valeurs. Si aucune commande n'est associée, le plugin essaiera de passer par la commande event pour mettre à jour l'information.",
	  "en_US":"This plugin allows you to capture different states, from different devices and call these states afterwards. To do this, simply set up in an equipment State Capture the equipment you want to photograph, position them in the desired state, and launch the capture. This capture can then be reloaded. You can set up multiple captures in a single device. Each capture keeps the values of all the info commands of the captured equipment, and searches for the associated commands. These commands will then be automatically called to update the device.   You can edit each capture to define which commands to update, to change the retained state, and which commands control the change of values. If no command is associated, the plugin will try to use the `event` command to update the information.",
	  "es_ES":"Este plugin te permite capturar diferentes estados, de diferentes equipos y llamar a estos estados después. Para ello, basta con que se instale en un estado de equipo Capturar el equipo que desea fotografiar, situarlo en el estado deseado e iniciar la captura. Esta captura se puede volver a cargar. Puedes configurar varias capturas en un solo dispositivo. Cada captura guarda los valores de todos los comandos de información del equipo capturado, y busca los comandos asociados. Estos comandos serán llamados automáticamente para actualizar el equipo.   Puede editar cada captura para definir los comandos que deben actualizarse, cambiar el estado retenido y los comandos que controlan el cambio de valores. Si no hay ningún comando asociado, el plugin intentará utilizar el comando `event` para actualizar la información."	  
   },
   "licence":"AGPL",
   "author":"Billyben",
   "require":"4.0.0",
   "category":"programming",
   "hasDependency":false,
   "hasOwnDeamon":false,
   "maxDependancyInstallTime":0,
   "changelog":"https://github.com/Bbillyben/State_Capturer/tree/master/docs/changelog.md",
   "documentation":"https://github.com/Bbillyben/State_Capturer/tree/master/docs/#language#/README.md",
   "changelog_beta":"https://github.com/Bbillyben/State_Capturer/tree/beta/docs/changelog.md",
   "documentation_beta":"https://github.com/Bbillyben/State_Capturer/tree/beta/docs/#language#/README.md",
   "link":{
      "forum":"Lien vers le forum"
   },
   "language":[
      "fr_FR",
	  "en_US",
	  "es_ES"
   ],
   "compatibility":[
      "miniplus",
      "smart",
      "rpi",
      "docker",
      "diy",
      "mobile",
      "v4",
      "atlas"
   ]
}
